'''
Дан список
['samsung', 'lg', 'xerox', 'bosch']
Удалить элемент с именем 'xerox'
Добавить элемент на 2 место 'indesit'

'''

list1 = ['samsung', 'lg', 'xerox', 'bosch']
list1.remove('xerox')
list1.insert(1, 'indesit')
print (list1)