'''
Дан произвольный список. Вывести на экран в обратном порядке. 
Задачу решить 2мя способами. 
'''

l = ["1", "2", "3"]

print  (l[::-1])

l.reverse()

print (l)

